In [97]:
import pandas as pd
import numpy as np

In [115]:
'''
Checks non-numeric then changes to Nan
Parameter: DataFrame 
return : x if its float else return np.nan
'''
def isnumber(x):
    try:
        float(x)
        return x
    except:
        return np.nan

In [136]:
'''
Reshape Numpy array to Dataframe
'''
set1=pd.DataFrame(np.array([3,'?',2,5,'*',4,5,6,'+',3,2,'&',5,'?',7,'!']).reshape(4,4))
set1

   0  1  2  3
0  3  ?  2  5
1  *  4  5  6
2  +  3  2  &
3  5  ?  7  !

In [137]:
'''
Use function isnumber to change non-numeric value to np.nan
'''
set2=set1.applymap(isnumber)
set2

     0    1  2    3
0    3  NaN  2    5
1  NaN    4  5    6
2  NaN    3  2  NaN
3    5  NaN  7  NaN

In [119]:
set2.isna().any()

0     True
1     True
2    False
3     True
dtype: bool

In [120]:
set2.isna().sum()

0    2
1    2
2    0
3    2
dtype: int64

In [121]:
set2.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [122]:
set2.dropna(how='all')

     0    1  2    3
0    3  NaN  2    5
1  NaN    4  5    6
2  NaN    3  2  NaN
3    5  NaN  7  NaN

In [123]:
set2.dropna(thresh=1)

     0    1  2    3
0    3  NaN  2    5
1  NaN    4  5    6
2  NaN    3  2  NaN
3    5  NaN  7  NaN

In [124]:
set2.dropna(thresh=2)

     0    1  2    3
0    3  NaN  2    5
1  NaN    4  5    6
2  NaN    3  2  NaN
3    5  NaN  7  NaN

In [135]:
set2.fillna(set2.apply(pd.to_numeric).mean())

   0    1  2    3
0  3  3.5  2    5
1  4    4  5    6
2  4    3  2  5.5
3  5  3.5  7  5.5

In [130]:
set2.fillna(set2.median())

   0    1  2    3
0  3  3.5  2    5
1  4    4  5    6
2  4    3  2  5.5
3  5  3.5  7  5.5

In [138]:
set2.fillna(100)

     0    1  2    3
0    3  100  2    5
1  100    4  5    6
2  100    3  2  100
3    5  100  7  100

In [147]:
set2.fillna(axis=0, method='ffill')

   0    1  2  3
0  3  NaN  2  5
1  3    4  5  6
2  3    3  2  6
3  5    3  7  6

In [146]:
set2.fillna(axis=0, method='bfill')

   0    1  2    3
0  3    4  2    5
1  5    4  5    6
2  5    3  2  NaN
3  5  NaN  7  NaN